# CheckRangeOfPercentageSkylights Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyDataSettings..::..CheckRangeOfPercentageSkylights Method
EnergyDataSettings Class See Also
---
Checks that the percentage skylights value is between 0.00 and 0.95.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static bool CheckRangeOfPercentageSkylights(
	double percentageSkylights
)
```

Visual Basic
---
```text
Public Shared Function CheckRangeOfPercentageSkylights ( _
	percentageSkylights As Double _
) As Boolean
```

Visual C++
---
```text
public:
static bool CheckRangeOfPercentageSkylights(
	double percentageSkylights
)
```

# ### Parameters
percentageSkylights
    Type: System..::..Double The percentage skylights to be checked.
# ### Return Value
True if the percentage skylights value is between 0.00 and 0.95, false otherwise.
# See Also
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace